showcase-scheme.org
#+TITLE: scheme Examples
#+AUTHOR: Aidan Pace <apace@defrecord.com>
#+DATE: 2025-06-09
#+PROPERTY: header-args :padline yes :comments both
#+OPTIONS: toc:3 num:t

* scheme Examples

** computational-models-guide

#+BEGIN_SRC scheme :tangle src/scheme/computational-models-guide.scm :mkdirp yes
;; Computational Models Integration Guide
;; A framework for unifying different computational models in Scheme

;;; Generic Computational Model Interface

;; Factory function to create computational models of different types
(define (make-computation-model type . options)
  (case type
    ((quantum) (apply make-quantum-computer options))
    ((logic) (apply make-virtual-computer options))
    ((stack) (apply make-stack-machine options))
    ((cellular) (apply make-life-computer options))
    ((turing) (apply make-turing-machine options))
    (else (error "Unknown computation model type:" type))))

;;; Model Implementations

;; Quantum Computer Interface Wrapper
;; Assumes quantum-simulator.scm has been loaded
(define (make-quantum-computer)
  (let ((qubit (new-qubit))
        (measurements '()))
    
    ;; Interface implementation
    (lambda (op . args)
      (case op
        ((initialize)
         (set! qubit (new-qubit))
         (set! measurements '()))
        
        ((step)
         (let ((gate (if (null? args) 'h (car args))))
           (case gate
             ((x) (set! qubit (apply-x qubit)))
             ((h) (set! qubit (apply-h qubit)))
             ((z) (set! qubit (apply-z qubit)))
             ((measure) 
              (let ((result (measure-qubit! qubit)))
                (set! measurements (cons result measurements))
                result))
             (else (error "Unknown quantum gate:" gate)))))
        
        ((run)
         (let ((steps (if (null? args) 1 (car args)))
               (gate (if (or (null? args) (null? (cdr args))) 'h (cadr args))))
           (do ((i 0 (+ i 1)))
               ((>= i steps))
             (if (eq? gate 'measure)
                 ((lambda () (display "Measurement result: ") 
                           (display ((self 'step) 'measure))
                           (newline)))
                 ((lambda () ((self 'step) gate)))))))
        
        ((state)
         (list 'qubit qubit 'measurements measurements))
        
        ((reset)
         ((self 'initialize)))
        
        (else (error "Unknown operation:" op))))))

;; Logic Computer Interface Wrapper
;; Assumes logic-gates.scm is loaded
(define (make-virtual-computer . args)
  (let ((memory-size (if (null? args) 256 (car args)))
        (memory (make-vector 256 #f))
        (registers (make-vector 8 #f)))
    
    ;; Define the interface function
    (define (self op . args)
      (case op
        ((initialize)
         (vector-fill! memory #f)
         (vector-fill! registers #f))
        
        ((step)
         (let ((instr (if (null? args) 'noop (car args))))
           (case instr
             ((and) (logic-and))
             ((or) (logic-or))
             ((not) (logic-not))
             ((add) (adder))
             (else (error "Unknown logic instruction:" instr)))))
        
        ((run)
         (let ((steps (if (null? args) 1 (car args))))
           (do ((i 0 (+ i 1)))
               ((>= i steps))
             ((self 'step)))))
        
        ((state)
         (list 'memory memory 'registers registers))
        
        ((reset)
         ((self 'initialize)))
        
        (else (error "Unknown operation:" op))))
    
    ;; Initialize and return the interface
    (self 'initialize)
    self))

;; Stack Machine Interface Wrapper
;; Assumes stack-machine.scm is loaded
(define (make-stack-machine . args)
  (let ((memory-size (if (null? args) 100 (car args)))
        (machine (make-stack-machine memory-size)))
    
    ;; Interface implementation
    (lambda (op . args)
      (case op
        ((initialize)
         (machine 'reset))
        
        ((step)
         (machine 'step))
        
        ((run)
         (let ((steps (if (null? args) 1 (car args))))
           (if (= steps -1)
               (machine 'run)  ; Run until halted
               (do ((i 0 (+ i 1)))
                   ((>= i steps))
                 (machine 'step)))))
        
        ((state)
         (machine 'status))
        
        ((reset)
         (machine 'reset))
        
        ((load)
         (if (not (null? args))
             (machine 'load (car args))))
        
        (else (error "Unknown operation:" op))))))

;; Placeholder for Cellular Automaton (would reference a life.scm implementation)
(define (make-life-computer . args)
  (let ((width (if (null? args) 20 (car args)))
        (height (if (or (null? args) (null? (cdr args))) 20 (cadr args)))
        (grid (make-vector (* width height) #f)))
    
    ;; Interface implementation
    (lambda (op . args)
      (case op
        ((initialize)
         ;; Reset grid
         (vector-fill! grid #f))
        
        ((step)
         ;; Compute one generation
         'step-placeholder)
        
        ((run)
         (let ((steps (if (null? args) 1 (car args))))
           (do ((i 0 (+ i 1)))
               ((>= i steps))
             ((self 'step)))))
        
        ((state)
         grid)
        
        ((reset)
         ((self 'initialize)))
        
        (else (error "Unknown operation:" op))))))

;; Placeholder for Turing Machine (would reference a turing.scm implementation)
(define (make-turing-machine . args)
  (let ((tape (make-vector 100 0))
        (position 50)
        (state 'q0))
    
    ;; Interface implementation
    (lambda (op . args)
      (case op
        ((initialize)
         ;; Reset tape, position, and state
         (vector-fill! tape 0)
         (set! position 50)
         (set! state 'q0))
        
        ((step)
         ;; Execute one Turing Machine step
         'step-placeholder)
        
        ((run)
         (let ((steps (if (null? args) 1 (car args))))
           (do ((i 0 (+ i 1)))
               ((>= i steps))
             ((self 'step)))))
        
        ((state)
         (list 'tape tape 'position position 'state state))
        
        ((reset)
         ((self 'initialize)))
        
        (else (error "Unknown operation:" op))))))

;;; Demonstration Functions

;; Demonstrate the quantum computer model
(define (demo-quantum)
  (let ((qc (make-computation-model 'quantum)))
    (display "Quantum Computer Demonstration\n")
    (display "==============================\n")
    
    (display "Initial state: ")
    (display (qc 'state))
    (newline)
    
    (display "Applying H gate: ")
    (qc 'step 'h)
    (display (qc 'state))
    (newline)
    
    (display "Measuring: ")
    (qc 'step 'measure)
    (display (qc 'state))
    (newline)))

;; Demonstrate the stack machine model
(define (demo-stack)
  (let ((sm (make-computation-model 'stack 100)))
    (display "Stack Machine Demonstration\n")
    (display "===========================\n")
    
    ;; Load the factorial program defined in stack-machine.scm
    (sm 'load factorial-program)
    
    (display "Initial state:\n")
    (sm 'state)
    (newline)
    
    (display "Running program...\n")
    (sm 'run -1)  ; Run until halted
    
    (display "Final state:\n")
    (sm 'state)
    (newline)))

;; Run all model demonstrations
(define (run-computational-models-demo)
  (display "Computational Models Integration Framework\n")
  (display "========================================\n\n")
  
  (demo-quantum)
  (newline)
  (demo-stack)
  (newline)
  
  (display "Integration framework demonstration complete.\n"))

;; The demos would be run if this file is loaded directly
;; Note: This requires the model implementations to be loaded first#+END_SRC

** factorial

#+BEGIN_SRC scheme :tangle src/scheme/factorial.scm :mkdirp yes
;; Recursive implementation
(define (factorial-recursive n)
  (if (<= n 1)
      1
      (* n (factorial-recursive (- n 1)))))

;; Tail-recursive implementation
(define (factorial-tail n)
  (define (fact-iter product counter max-count)
    (if (> counter max-count)
        product
        (fact-iter (* counter product)
                  (+ counter 1)
                  max-count)))
  (fact-iter 1 1 n))

;; Example usage
(define (run-examples)
  (display "Factorial of 5 (recursive): ")
  (display (factorial-recursive 5))
  (newline)
  (display "Factorial of 5 (tail-recursive): ")
  (display (factorial-tail 5))
  (newline))

(run-examples)
#+END_SRC

** fibonacci

#+BEGIN_SRC scheme :tangle src/scheme/fibonacci.scm :mkdirp yes
;; Recursive implementation
(define (fib-recursive n)
  (cond ((= n 0) 0)
        ((= n 1) 1)
        (else (+ (fib-recursive (- n 1))
                (fib-recursive (- n 2))))))

;; Tail-recursive implementation
(define (fib-tail n)
  (define (fib-iter a b count)
    (if (= count 0)
        a
        (fib-iter b (+ a b) (- count 1))))
  (fib-iter 0 1 n))

;; Continuation-passing style
(define (fib-cps n k)
  (cond ((= n 0) (k 0))
        ((= n 1) (k 1))
        (else (fib-cps (- n 1)
                      (lambda (v1)
                        (fib-cps (- n 2)
                               (lambda (v2)
                                 (k (+ v1 v2)))))))))

(define (fib n)
  (fib-cps n (lambda (x) x)))

;; Example usage
(define (run-examples)
  (display "Fibonacci of 10 (recursive): ")
  (display (fib-recursive 10))
  (newline)
  (display "Fibonacci of 10 (tail-recursive): ")
  (display (fib-tail 10))
  (newline)
  (display "Fibonacci of 10 (CPS): ")
  (display (fib 10))
  (newline))

(run-examples)
#+END_SRC

** fizzbuzz

#+BEGIN_SRC scheme :tangle src/scheme/fizzbuzz.scm :mkdirp yes
;; Helper: display FizzBuzz for a number
(define (fizzbuzz-number n)
  (cond ((= (remainder n 15) 0) "FizzBuzz")
        ((= (remainder n 3) 0) "Fizz")
        ((= (remainder n 5) 0) "Buzz")
        (else n)))

;; Print FizzBuzz sequence
(define (fizzbuzz n)
  (define (iter i)
    (when (<= i n)
      (display (fizzbuzz-number i))
      (newline)
      (iter (+ i 1))))
  (iter 1))

;; Create a list of FizzBuzz values
(define (fizzbuzz-list n)
  (define (iter i result)
    (if (> i n)
        (reverse result)
        (iter (+ i 1) (cons (fizzbuzz-number i) result))))
  (iter 1 '()))

;; Example usage
(define (run-examples)
  (display "FizzBuzz (1-20):\n")
  (fizzbuzz 20)
  (display "\nFizzBuzz as list (1-20): ")
  (display (fizzbuzz-list 20))
  (newline))

(run-examples)
#+END_SRC

** primes

#+BEGIN_SRC scheme :tangle src/scheme/primes.scm :mkdirp yes
;; Helper function: square root
(define (square x) (* x x))

;; Check if a number is prime
(define (prime? n)
  (define (smallest-divisor n)
    (find-divisor n 2))
  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (+ test-divisor 1)))))
  (define (divides? a b)
    (= (remainder b a) 0))
  (and (> n 1) (= n (smallest-divisor n))))

;; Generate primes up to n
(define (primes-up-to n)
  (define (iter i result)
    (cond ((> i n) (reverse result))
          ((prime? i) (iter (+ i 1) (cons i result)))
          (else (iter (+ i 1) result))))
  (iter 2 '()))

;; Sieve of Eratosthenes (using lists)
(define (sieve-of-eratosthenes n)
  (define (sieve numbers)
    (if (null? numbers)
        '()
        (let ((p (car numbers)))
          (cons p (sieve (filter
                         (lambda (x) (not (= 0 (remainder x p))))
                         (cdr numbers)))))))
  (sieve (range 2 n)))

;; Helper: generate a range of numbers
(define (range start end)
  (if (> start end)
      '()
      (cons start (range (+ start 1) end))))

;; Example usage
(define (run-examples)
  (display "Primes up to 20: ")
  (display (primes-up-to 20))
  (newline)
  (display "Primes up to 20 (sieve): ")
  (display (sieve-of-eratosthenes 21))
  (newline)
  (display "Is 17 prime? ")
  (display (prime? 17))
  (newline)
  (display "Is 15 prime? ")
  (display (prime? 15))
  (newline))

(run-examples)
#+END_SRC

